import styled from "./confidence.module.css"
import Image from "next/image";
import Images from "../../../resources/image";

const Confidence = (props) => {
    const {closeConfidence} = props;
    return (
        <div className={styled.textSlyle}>
            <div className={styled.container}>
            <div className={styled.closeBtn} onClick={closeConfidence}>
                <Image src={Images.closeBtn.src} /></div>
            <h2>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАННИХ</h2>
            <p>
                <span>
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1. Загальні положення<br/>
                    Згідно Закону України від 01 червня 2010 року № 2297-VI «Про захист персональних даних» (надалі – «Закон») під персональними даними розуміють відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована. Згідно Політики конфіденційності в поняття "особистої інформації" входить інформація, або частина інформації, котра дозволяє Вас ідентифікувати. Як правило сюди входить ім’я та прізвище, псевдонім (нік), адреса електронної пошти та номер телефону, може також входити така інформація, як IP-адреса. Такі відомості ми можемо отримати безпосередньо від Вас, наприклад, при реєстрації на сайті, наданні контактних даних, інформації отриманої із банківської картки або платежів, а також іншу особисту інформацію, яку Ви добровільно надали нам.
                    Компанія з великою повагою ставиться до конфіденційної (персональної) інформації всіх без винятку осіб, які відвідали сайт, а також тих, хто користується наданими сайтом послугами; в зв'язку з чим, Компанія прагне захищати конфіденційність персональних даних (відомостей чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована), тим самим створивши і забезпечивши максимально комфортні умови використання сервісів Сайту кожному користувачеві.<br/>
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. Використання та мета збору персональних даних.<br/>
                    Особиста інформація відвідувачів сайту, зібрана при реєстрації, переважно використовується для надання послуг у відповідності з Вашими потребами, в першу чергу для надання послуг або у договірних відносинах, а також для відповідей на Ваші запитання. Також ми можемо використовувати Вашу контактну інформацію в поштових відправленнях, а саме повідомляти Вас про нові можливості, акції та інші новини; подання резюме; моніторингу та забезпечення дотримання умов використання сайту Компанії; узагальнення даних для аналітики та вдосконалення роботи сайту.
                    Сайт Компанії не збирає та не накопичує дані для їх поширення або продажу третім сторонам для цілей споживчого маркетингу або інформаційних розсилок від імені третіх сторін. Компанія має право збирати, обробляти і зберігати будь-яку інформацію, яку Суб’єкти залишають на Сайті третіх сторін шляхом введення в форми запиту даних, а також передають на Сайт Компанії будь-яким іншим чином. Персональні дані, зібрані через сайт Компанії, зберігатимуться Компанією протягом необхідного часу (тобто протягом того періоду, поки Компанія має відносини з відповідною фізичною особою). Якщо Ви продовжуєте користуватися сайтом Компанії, Ви: безумовно, повністю та без будь-яких змін приймаєте дані умови; проінформовані, що на сайті може відбуватися збір Ваших персональних даних та їх подальша обробка за допомогою технічних засобів; свідомо та добровільно даєте згоду на збір та обробку всіх наданих персональних даних; надаєте згоду на обробку та передачу Ваших персональних даних, якщо цього вимагають умови користування сайтом; надаєте згоду на збір та зберігання Ваших персональних даних без обмеження строку дії до тих пір, поки це є необхідним для їхньої обробки, або Ви не звернетеся з вимогою чи побажанням припинити обробку/знищити Ваші персональні дані чи за інших умов відповідно до законодавства; надаєте згоду на використання файлів cookie. Під час відвідування Сайту Компанії автоматично збирається певна інформація, яка не дозволяє ідентифікувати фізичну особу - суб’єкта персональних даних. Ця інформація може включати в себе таке: Статистика перегляду: Компанія збирає інформацію про розділи Сайту, які в основному переглядають відвідувачі, частоту з'єднань із Сайтом, програмне та апаратне забезпечення, використане для відвідування Сайту, географію відвідувачів. Ця інформація дозволяє Компанії зрозуміти, як відвідувачі працюють із Сайтом. Журнали: Обладнання хостинг-провайдера Компанії може записувати запити, зроблені відвідувачами Сайту, інформацію про програмне та апаратне забезпечення, які використовуються для відвідування Сайту, присвоєння IP-адреси, а також часу, пов'язаного з доступом. Компанія використовує цю інформацію для підвищення безпеки Сайту. Файл cookie: Файл cookie – це текстовий рядок, який Сайт передає файлу cookie браузера на комп'ютері Суб’єкта персональних даних, щоб Сайт міг пам'ятати налаштування такого Суб’єкта. Компанія використовує дані файлів cookie, щоб аналізувати поведінку відвідувачів та покращувати досвід користувачів. Якщо Суб’єкт персональних даних не погоджується на використання файлів cookie, більшість сучасних браузерів надає користувачам можливість заборонити їх отримання. Для реєстрації на сайті Компанії згода на отримання файлів cookie є обов'язковою. Інші функції сайту можуть працювати некоректно у разі блокування файлів cookie. Після завершення відвідання сайту Компанії можливо у будь-який момент видалити за бажанням файли cookie зі своєї системи.
                    Ми діємо відповідно до цієї Політики конфіденційності, на підставі Положення про обробку і захист персональних даних та на підставі чинного законодавства України.
                    Ми маємо право зберігати Персональні дані стільки, скільки необхідно для реалізації мети, що зазначена у даній Політиці або у строки, встановлені чинним законодавством України або до моменту видалення Вами цих даних.<br/>
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3. Надання доступу до інформації.<br/>
                    Надання доступу до особистої інформації іншим компаніям і приватним особам можливе лише за таких наступних обставин:
                    Має місце наявність дозволу Користувача. Для передачі будь-якої конфіденційної інформації потрібна явна згода Користувача.
                    В випадках визначених чинним законодавством України, а також у випадках запобігання злочину або завдання шкоди нам або третім особам.<br/>
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4. Захист інформації.<br/>
                    Ми вживаємо всіх необхідних заходів для захисту даних від несанкціонованого доступу, зміни, розкриття чи знищення. До цих заходів належать, зокрема, внутрішня перевірка процесів збору, зберігання та обробки даних і заходів безпеки, включаючи відповідне шифрування і заходи щодо забезпечення фізичної безпеки даних для запобігання неавторизованого доступу до систем, в яких ми зберігаємо особисті дані.
                    Сайт не спрямований і не призначений особам молодше 18 років. Якщо Суб’єкт молодше 18 років, він повинен не надавати Компанії персональних даних без згоди батьків, опікуна, органів опіки та піклування.
                    Сайт може містити посилання на сторонні веб-сайти. Компанія не несе відповідальності за зміст і практику забезпечення конфіденційності такими вебсайтами.<br/>
                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5. Зміна політики конфіденційності.<br/>
                    Користувач приймає умови цієї політики конфіденційності і враховує, що дана політика конфіденційності може час від часу змінюватися. Зміни, що вносяться до політики конфіденційності, публікуються на цій сторінці.
                    З питань щодо політики конфіденційності (в т.ч. видалення персональних даних), Користувач може зв'язатися з нами використовуючи e-mail: chinimboiler@gmail.com

                </span>
            </p>
            </div>
        </div>
    )
}

export default Confidence