const Texts = {
    ua: {
        priceList: [
            {
                id: 0,
                priceName: 'Попередня консультація майстра по телефону або онлайн',
                price: 'Безкоштовно'
            },
            {
                id: 1,
                priceName: 'Виклик майстра з проведенням діагностики*',
                price: 'від 300 грн.**'
            },
            {
                id: 2,
                priceName: 'Заміна елементів та запчастин водонагрівача',
                price: 'від 500 грн.**'
            },
            {
                id: 3,
                priceName: 'Первинне встановлення бойлера',
                price: 'від 1500 грн.**'
            },
            {
                id: 4,
                priceName: 'Перевстановлення бойлера',
                price: 'від 1000 грн.**'
            },
            {
                id: 5,
                priceName: 'Чистка бойлера: зливання води, чистка, заміна аноду',
                price: '15 грн. за 1 літр**'
            },
        ],
        title: 'РЕМОНТ БОЙЛЕРІВ',
        subTitle1: 'УСІХ МАРОК',
        priceTitle: 'ПРАЙС',
        subTitle: 'Здійснюємо ремонт у день звернення, швидко та якісно',
        note1: '*діагностика пристрою, розбирання, збирання без злиття води.',
        note2: '**вартість вказана за роботу майстра. Вартість матеріалів оплачується окремо згідно марки бойлера та причини поломки. Вартість роботи майстра може змінюватись у разі специфіки встановлення та розташування водонагрівача.',
        note3: 'Гарантійний термін на роботу майстра 1 рік.',
        note4: '***Вартість даної послуги розраховується майстром у день звернення, по актуальним цінам ринку. У вартість буде входити виїзд майстра із замірами, придбання бойлера, доставка за адресою, монтаж, встановлення редуктора, кранів, а також сама робота майстра.',
        priceName: 'Послуга «бойлер під ключ»***',
        priceDescription: "Якщо Ви не знаєте який бойлер краще придбати або де замовити, як встановити та ще багато питань, не проблема! Наш майстер зробить все за Вас! Підбере найкращий варіант згідно всіх Ваших побажань, вартості, доставить водонагрівач, та виконає установку маючи при собі всі необхідні матеріали.",
        aboutUsTitle: 'ВИКЛИК МАЙСТРА НЕОБХІДНИЙ У ВИПАДКУ, ЯКЩО',
        causeText: 'пристрій не вмикається;',
        causeText1: 'повільно нагріває або не набирає воду;',
        causeText2: 'водонагрівач протікає;',
        causeText3: 'слабкий або занадто сильний напір в крані;',
        causeText4: 'водонагрівач б’ється струмом;',
        causeText5: 'некоректно працює ПЗВ (пристрій захисного відключення);',
        causeText6: 'вода має неприємний запах або іржавий колір.',
        aboutUsText1: 'Ми професійно вирішимо всі перераховані та інші проблеми з Вашим бойлером. В залежності від ситуації можуть знадобитись прочистка або заміна бака, ремонт шляхів електроживлення, заміна нагрівальних елементів, клапану, редуктора, блоку управління, укріплення дренажної трубки та інші види робіт.',
        button1: '+38(095)-367-47-03',
        button2: 'Залишити заявку',
        msTitle: 'РЕМОНТ БОЙЛЕРІВ УСІХ МАРОК',
        msText1: 'Здійснюємо ремонт у день звернення, швидко та якісно.',
        msText2: 'Наші переваги',
        msTextListItem1: 'Ремонт водонагрівачів усіх марок та моделей.',
        msTextListItem2: 'Виїзд майстра в день звернення в усі райони Києва, а також передмістя.',
        msTextListItem3: 'Гарантія на роботу майстра 1 рік.',
        msTextListItem4: 'Візит майстра з усіма комплектами для ремонту.',
        msTextListItem5: 'Зручна для Вас оплата, готівкою або на банківську картку',
        msTextListItem6: 'Встановлення бойлеру «під ключ»',
        contactTitle: 'Контакти',
        contactText1:'+38(095)-367-47-03',
        contactText1a:'Телефон:',
        contactText2a:'Email:',
        contactText2:'chinimboiler@gmail.com',
        contactText3a:'Графік роботи:',
        contactText3:'щодня з 7:00 до 22:00',
    },
    ru: {
        priceList: [
            {
                id: 0,
                priceName: 'Предварительная консультация мастера по телефону или онлайн',
                price: 'Бесплатно'
            },
            {
                id: 1,
                priceName: 'Вызов мастера с проведением диагностики*',
                price: 'від 300 грн.**'
            },
            {
                id: 2,
                priceName: 'Замена элементов и запчастей водонагревателя',
                price: 'від 500 грн.**'
            },
            {
                id: 3,
                priceName: 'Первичная установка бойлера',
                price: 'від 1500 грн.**'
            },
            {
                id: 4,
                priceName: 'Переустановка бойлера',
                price: 'від 1000 грн.**'
            },
            {
                id: 5,
                priceName: 'Чистка бойлера: слив воды, чистка, замена анода',
                price: '15 грн. за 1 літр**'
            },
        ],
        title: 'РЕМОНТ БОЙЛЕРОВ ВСЕХ МАРОК',
        priceTitle: 'ПРАЙС',
        subTitle: 'Осуществляем ремонт в день обращения, быстро и качественно',
        note1: '*диагностика устройства, разборка, сборка без слития воды.',
        note2: '**стоимость указана за работу мастера. Стоимость материалов и запчастей оплачивается отдельно согласно марки бойлера и причины поломки. Стоимость работы мастера может менятся в случае специфики установки и расположения водонагревателя.',
        note3: 'Гарантийный срок на работу мастера 1 год.',
        note4: '***Стоимость данной услуги рассчитывается мастером в день обращения, по актуальным ценам рынка. В стоимость будет входить выезд мастера с замерами, приобретение бойлера, доставка по адресу, монтаж, установка редуктора, кранов, а так же сама работа мастера.',
        priceName: 'Услуга «бойлер под ключ»***',
        priceDescription: "Если Вы не знаете какой бойлер лучше приобрести или где заказать, как установить и еще много вопросов, не проблема! Наш мастер сделает все за Вас! Подберет лучший вариант по всем Вашим предпочтениям, стоимости, доставит водонагреватель, и установит имея при себе все необходимые материалы.",
        causeList: [
            {
                caulseText: 'прибор не включается;',
                id: 0
            },
            {
                caulseText: 'медленно нагревает или не набирает воду;',
                id: 1
            },
            {
                caulseText: 'водонагреватель течёт;',
                id: 2
            },
            {
                caulseText: 'слабый или чересчур сильный напор в кране;',
                id: 3
            },
            {
                caulseText: 'водонагреватель бьется током;',
                id: 4
            }
            , {
                caulseText: 'некорректно работает УЗО (устройство защитного отключения);',
                id: 5
            },
            {
                caulseText: 'вода имеет неприятный запах или ржавый окрас.',
                id: 6
            }
        ],
        aboutUsText1: 'Мы профессионально решим перечисленные и иные проблемы с Вашим бойлером. В зависимости от ситуации могут понадобиться прочистка или замена бака, ремонт путей электропитания, замена нагревательных элементов, клапана, редуктора, блока управления, укрепление дренажной трубки и другие работы.',
        button1: 'Позвонить',
        button2: 'Оставить заявку',
    }
}

export default Texts